# .1 רשימות בסיס-

# a. צור רשימה ריקה והכנס לתוכה את המספרים 1-100 בלולאת for באמצעות append
numbers: list[int] = []
for i in range(1,100 + 1):
    numbers.append(i)
print(numbers, end=" ")
print()

# b. הדפס את האיבר הראשון ברשימה שייצרת רמז אינדקס 0
print(numbers[0])

# c. הדפס את האיבר האחרון ברשימה שייצרת רמז אינדקס -1
print(numbers[-1])


# d. הדפס כמה איברים יש ברשימה רמז: len
len(numbers)


# e. צור והדפס רשימה של המספרים 3-12 כולל רמז: נקודותיים סיום:התחלה
print(numbers [2:12])


# f. צור והדפס רשימה של המספרים 80 ועד לסוף הרשימה )רמז: נקודותיים חצי ריק (
print(numbers[79:])


# g. צור והדפס רשימה של המספרים מתחילת הרשימה ועד אינדקס 17
print(numbers [:17])


# h. הדפס את הרשימה בסדר הפוך רמז פעמיים נקודותיים עם -1
print(numbers [::-1])


# i. הדפס את כל המספרים הזוגיים ב רשימה כלומר ,2 ,4 ,6 8 ... רמז: התחל מאינדקס
# של המספר 2 וקפוץ בדילוגים של 2 השתמש בפעמיים נקודותיים 0:100:2
print(numbers[1::2])

# j. הדפס את כל המספרים המתחלקים ב 3 ללא שארית , כלומר ,3 ,6 ,9 12 ...
print(numbers[2::3])


# k. הדפס את כל המספרים המתחלקים ב 7 ללא שארית , כלומר ,7 ,14 21 ...
print(numbers[6::7])


# l. הדפס את כל הכפולות של ,10 כלומר ,10 ,20 30 ...
print(numbers[9::10])


# m. הדפס את המספרים מ 99 ועד 66 בדילוגים של ,3 כלומר ,99 ,96 ...,93ועד 66
print(numbers[98:66-3:-3])


# n. הכנס את המספר 999 במרכז הרשימה )רמז insert )
numbers.insert(50, 999)
print(numbers)


# o. הוצא את המספר 100 מהרשימה )רמז: pop )
numbers.pop()
print(numbers[90:])

